In [4]:
import pandas as pd
import os
import sqlite3

file = 'college.xlsx'
df1 = pd.read_excel(file)
sql_db = sqlite3.connect('Closed_college.db')
df1.to_sql('College', sql_db, if_exists = 'replace')



def run_query(query):
    df = pd.read_sql_query(query, sql_db)
    return df

In [5]:
query = 'SELECT * FROM College LIMIT 25'
run_query(query)

,index,Name,OPEID,Location,Geographic_Location,Teacher_num,student_num
0,0,John Wesley University,293500.0,"High Point,North Carolina",Northeast,200,4500
1,1,Southern Catholic College,4128500.0,"Dawsonville, Georgia",South,150,5000
2,2,Vennard College,NaN,"University Park, Iowa",Midwest,100,3500
3,3,Mid-Continent University,2576200.0,"Mayfield, Kentucky",South,200,4500
4,4,Baltimore Hebrew University,NaN,"Baltimore, Maryland",None,450,2600
5,5,College of Visual Arts,746200.0,"Saint Paul, Minnesota",Midwest,100,4500
6,6,Pillsbury Baptist Bible College,2284500.0,"Owatonna, Minnesota",None,150,3700
7,7,Chester College of New England,473300.0,"Chester, New Hampshire",Northeast,230,3900
8,8,Lambuth University,349800.0,"Jackson, Tennessee",South,190,4200
9,9,Coleman University,729600.0,"San Diego, California",Midwest,220,3700

In [6]:
df1.count()

Name                   10
OPEID                   8
Location               10
Geographic_Location     8
Teacher_num            10
student_num            10
dtype: int64

In [7]:
df1.isnull().sum()

#Sum of null rows per each column

Name                   0
OPEID                  2
Location               0
Geographic_Location    2
Teacher_num            0
student_num            0
dtype: int64

In [8]:
df1['OPEID'] = df1['OPEID'].fillna('0')

#filling null values for column 'Religious Affilation' with 'No religion'

In [29]:
print (df1['OPEID'])

0        293500
1    4.1285e+06
2             0
3    2.5762e+06
4             0
5        746200
6    2.2845e+06
7        473300
8        349800
9        729600
Name: OPEID, dtype: object

In [9]:
df1['Geographic_Location']

0    Northeast
1        South
2      Midwest
3        South
4          NaN
5      Midwest
6          NaN
7    Northeast
8        South
9      Midwest
Name: Geographic_Location, dtype: object

In [12]:
empty_Geo_Location = df1.dropna(inplace=True)
df1.isnull().sum()

Name                   0
OPEID                  0
Location               0
Geographic_Location    0
Teacher_num            0
student_num            0
dtype: int64

In [13]:
df1

,Name,OPEID,Location,Geographic_Location,Teacher_num,student_num
0,John Wesley University,293500,"High Point,North Carolina",Northeast,200,4500
1,Southern Catholic College,4.1285e+06,"Dawsonville, Georgia",South,150,5000
2,Vennard College,0,"University Park, Iowa",Midwest,100,3500
3,Mid-Continent University,2.5762e+06,"Mayfield, Kentucky",South,200,4500
5,College of Visual Arts,746200,"Saint Paul, Minnesota",Midwest,100,4500
7,Chester College of New England,473300,"Chester, New Hampshire",Northeast,230,3900
8,Lambuth University,349800,"Jackson, Tennessee",South,190,4200
9,Coleman University,729600,"San Diego, California",Midwest,220,3700

In [14]:
df1.isnull().sum()

Name                   0
OPEID                  0
Location               0
Geographic_Location    0
Teacher_num            0
student_num            0
dtype: int64

In [16]:
query_Geo_Location = """
select 
 Geographic_Location
 ,sum(Teacher_num) as "Total Teacher"
 ,avg(Teacher_num) as "Avg Teacher"
,sum(student_num) as "Total Student"
,avg(student_num) as "Avg Student"
,count(*) as "Number of Colleges"
from College
group by Geographic_Location; """

run_query(query_Geo_Location)

,Geographic_Location,Total Teacher,Avg Teacher,Total Student,Avg Student,Number of Colleges
0,None,600,300.0,6300,3150.000000,2
1,Midwest,420,140.0,11700,3900.000000,3
2,Northeast,430,215.0,8400,4200.000000,2
3,South,540,180.0,13700,4566.666667,3

In [17]:
query_college_per_location = """
select 
Geographic_Location
,count(*) as "Colleges per Geo Location"
from College
group by Geographic_LOcation
order by "Colleges per Geo Location" asc;
"""

run_query(query_college_per_location)

  Geographic_Location  Colleges per Geo Location
0                None                          2
1           Northeast                          2
2             Midwest                          3
3               South                          3